app/controllers/api/v1/tasks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."completed" = ?  [["user_id", 2], ["completed", true]]
---
  def index
    user = User.find_by(id: params[:user_id])
    unless user
      render json: { error: "user not found"}, status: 404
      return
    end
    tasks_completed = user.tasks.where(completed: true)

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def create
    user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: params[:user_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    task = user.tasks.find_by(id: params[:id])