app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "uko"], ["email", "uko@uko.com"], ["created_at", 2016-11-28 09:32:45 UTC], ["updated_at", 2016-11-28 09:32:45 UTC]]
---
  def create
    user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "uko"], ["email", "uko@uko.com"], ["updated_at", 2016-11-28 09:34:51 UTC], ["id", 2]]
---
  def update
    user = User.find_by(id: params[:id])
    unless user
      render json: { error: "user not found" }, status: 404
      return
    end
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    user = User.find_by(id: params[:id])
    unless user
      render json: { error: "user not found" }, status: 404
      return
    end
    user.destroy